# parameters
#nc: 6  # number of classes
nc: 6
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [0.21202182 ,0.64858368, 0.2785013 , 1.05081886, 0.37163334 ,0.0463756]  # P3/8
  - [0.39515726 ,0.72833032, 0.41355078 ,0.02804848, 0.51272094 ,0.70914884]  # P4/16
  - [1.0073037 , 1.18294574, 1.09340268 ,0.4813085 , 1.19609824 ,0.27606258]  # P5/32
#anchors:
#  - [60.97,62.66, 176.93,79.67, 296.24,86.74]  # P3/8
#  - [75.83,197.99, 226.96,278.60, 75.39,338.89]  # P4/16
 # - [363.16,280.90, 348.58,433.70, 448.12,90.00]  # P5/32


# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
  
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1]],
   
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4  
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, PConv, [64]],
   [-1, 1, PConv, [64]],
   [-1, 1, PConv, [64]],
   [-1, 1, PConv, [64]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 11
   
         
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 16-P3/8  
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, PConv, [128]],
   [-1, 1, PConv, [128]],
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, PConv, [128]],
   [-1, 1, PConv, [128]],
   [-1, 1, Conv, [128, 1, 1]],
   [[-1, -4, -7, -8], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 26

         
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 31-P4/16  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, PConv, [256]],
   [-1, 1, PConv, [256]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, PConv, [256]],
   [-1, 1, PConv, [256]],
   [-1, 1, Conv, [256, 1, 1]],
   [[-1, -4, -7, -8], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 41


   [-1, 1, MP, []],
   [-1, 1, Conv, [512, 1, 1]],
   [-3, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 46-P5/32  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, PConv, [256]],
   [-1, 1, PConv, [256]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, PConv, [256]],
   [-1, 1, PConv, [256]],
   [-1, 1, Conv, [256, 1, 1]],
   [[-1, -4, -7, -8], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 56
  ]

# yolov7 head
head:
  [
   [-1, 1, SPPCSPC, [512]], # 57
  
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [41, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, PConv, [128]],
   [-1, 1, PConv, [128]],
   [-1, 1, PConv, [128]],
   [-1, 1, PConv, [128]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 69
   
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [26, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, PConv, [64]],
   [-1, 1, PConv, [64]],
   [-1, 1, PConv, [64]],
   [-1, 1, PConv, [64]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]], # 81
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3, 71], 1, Concat, [1]],
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, PConv, [128]],
   [-1, 1, PConv, [128]],
   [-1, 1, PConv, [128]],
   [-1, 1, PConv, [128]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 94
      
   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3, 57], 1, Concat, [1]],
   
   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, PConv, [256]],
   [-1, 1, PConv, [256]],
   [-1, 1, PConv, [256]],
   [-1, 1, PConv, [256]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]], # 108
   
   [81, 1, RepConv, [256, 3, 1]],
   [94, 1, RepConv, [512, 3, 1]],
   [107, 1, RepConv, [1024, 3, 1]],

   [[108,109,110], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]